In [ ]:
# GROUP_BY
# agrupar funcoes => vem do SQL

In [8]:
import pandas as pd
# Cria um DataFrame
data = {'Classe':['Júnior','Júnior','Pleno','Pleno','Sênior','Sênior'],
       'Nome':['Jorge','Carlos','Roberta','Patrícia','Bruno','Vera'],
       'Venda':[200,120,340,124,243,350]}

In [9]:
data

{'Classe': ['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
 'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
 'Venda': [200, 120, 340, 124, 243, 350]}

In [10]:
# cria o DataFrame
df = pd.DataFrame(data)

In [11]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [ ]:
# usamos sempre que alguma condicao for verificada

In [25]:
# media de venda de cada um dos vendedores
#df.groupby("Classe") # pd faca agrupamento da coluna Classe

In [38]:
# groupby ele agrupa e depois ele vai expandir
# criando uma variavel para somar a coluna de vendas agrupada da coluna Classe
#group = df.groupby("Classe")
group = df.groupby("Classe")["Venda"].sum()
print(group)

Classe
Júnior    320
Pleno     464
Sênior    593
Name: Venda, dtype: int64

In [39]:
group

Classe
Júnior    320
Pleno     464
Sênior    593
Name: Venda, dtype: int64

In [40]:
group.sum()

np.int64(1377)

In [41]:
group.mean()

np.float64(459.0)

In [42]:
group = df.groupby("Classe")["Venda"].mean()
print(group)

Classe
Júnior    160.0
Pleno     232.0
Sênior    296.5
Name: Venda, dtype: float64

In [43]:
df.groupby("Classe").min() # quem vendeu menos

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [44]:
df.groupby("Classe").max() # quem vendeu mais, uma selecao

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [45]:
df # ver o conjunto de dados

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [50]:
# criar outra lista (CUIDADO QUE SE ALTERAR ELE ALTERA OS 2)
# df2 = df

In [47]:
DF

NameError: name 'DF' is not defined

In [51]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [49]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [52]:
# Para mudar os valores somente da df2 utilizar o metod copy
df2 = df.copy()
# df2["Venda"] = [150, 432, 190, 230, 410, 155]

In [53]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [54]:
# agora para alterar as informacoes da df2
df2["Venda"] = [150, 432, 190, 230, 410, 155]

In [55]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [56]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [57]:
# somatorio de duas tableas concat, uma 3 tabela
df3 = pd.concat([df, df2])

In [59]:
df3

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [60]:
# agrupar 2 indices classe e nome (agrupando listas)
df3.groupby(["Classe", "Nome"]).sum()

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505